Revit 2026 API

# PerformanceAdviser Properties

---

The PerformanceAdviser type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

PerformanceAdviser Class

Autodesk.Revit.DB Namespace